# 1st program

print((9**0.5)*5)

# 2nd program

print(9.99>9.98,1000!=1000.1)

# 3rd program

print(2*2+2)
print(2*(2+2))
print(6==8)
# ********************** подсмотрела верное решение, не поняла сразу задание сравнить выражения, сейчас разобралась
print(2*2+2==2*(2+2))

# 4th program

print("123.456") # выведение на печать текста
print(type("123.456")) # тип данных - строка

print(type(float("123.456"))) # выведение на печать числа с плавающей точкой преобразованного из строки

print(123.456*10)
print(1234.56%10)
# ************************************************ подсмотрела решение и разобрала по косточкам
# print - вывод на печать результата
# int - преобразование текста в число
# float - преобразование целого числа в число с плавающей точкой
# умножение
# деление без остатка
print(int(float("123.456")*10)%10)